from django.shortcuts import render,get_object_or_404
from datetime import date
from .models import product
from django.db.models import Avg,Max,Min

# Create your views here.
all_posts=[
    {'slug':'tarikhche',
     'title':'فرش پازیریک',
     'author':'جمع آورنده : عسکری',
     'image':'c1.png',
     'date':date(2019,2,10),
     'short_description':'قدمت فرش دستباف ایرانی به 2500 الی 2800 سال پیش از میلاد برمی گردد .',
     'content':"""
  فرش پازیریک قدیمی‌ترین و شناخته‌شده‌ترین فرش جهان است. این فرش بیش از دو هزار سال قدمت دارد و آن را متعلق به هنرمندان هخامنشی می‌دانند. برای همین بسیاری معتقدند که تاریخچه فرش ایرانی به قبل از میلاد مسیح برمی‌گردد. فرش پازیریک در سال ۱۹۴۹ توسط باستان‌شناس روسی سرگئی رودنکو پیدا شد. او در حین حفاری مقبره یک شاهزاده سکایی آن را در دره پازیریک سیبری یافت. این گور دخمه بیش از ۲۵۰۰ سال قدمت داشت و یک کشف اساسی در تاریخ قالی‌بافی بود.

به گفته برخی کارشناسان نساجی، این فرش اصالتاً ارمنی است و برخی دیگر ایرانی بودن آن را تأیید می‌کنند. اسب‌هایی هم که روی فرش باستانی نقش بسته، تقریباً شبیه به اسب‌هایی هستند که روی دیواره‌ای در شهر باستانی ایران، تخت جمشید، وجود دارد و ادعای ایرانی بودن این فرش را تأیید می‌کند. در حال حاضر، اصل فرش پازیریک در موزه ارمیتاژ سن‌پترزبورگ نگهداری می‌شود.
تاریخچه فرش ایرانی قبل از میلاد مسیح
با توجه به نظر برخی از کارشناسان و مورخان که فرش پازیریک را متعلق به ایران می‌دانند، پیشینه فرش ایرانی به چهار قرن پیش از میلاد مسیح می‌رسد. کسی که این فرش را کشف کرده است نیز در کتاب خود جزئیات طرح آن را چون وجود گوزن زرد خال‌دار ایرانی، اسب‌ها و سوارها را شبیه نمادهای دوره هخامنشی و آشوری می‌داند. با این توضیحات می‌توان به تاریخچه ۲۵۰۰ ساله فرش ایرانی اطمینان داشت.



     """},

    {'slug':'shahabasi',
     'title':'شاه عباسی',
     'author':'جمع آورنده : عسکری',
     'image':'c2.jfif',
     'date':date(2020,10,10),
     'short_description':'طرح های شاه‌عباسي بر پايه گل و بوته‌هاي ويژه‌اي كه به نام «گلهاي شاه‌عباسي» مشهورند شكل گرفته‌اند.',
     'content':"""
طرح‌هاي شاه‌عباسي بر پايه گل و بوته‌هاي ويژه‌اي كه به نام «گلهاي شاه‌عباسي» مشهورند شكل گرفته‌اند.

اين گل‌ها همراه با اسليمي‌ها، ختايي‌ها و ديگر نقشمايه‌هاي رايج در نقوش فرش، نگاره‌هاي اصلي را در حاشيه و متن فرش به وجود مي‌آورند.

طرحهاي شاه‌عباسي گونه‌هاي مختلفي دارند كه برخي از آنها عبارتند از: شاه عباسي لچك و ترنج، شاه‌ عباسي تصرفي، شاه ‌عباسي افشان و شاه‌عباسي طره‌اي.



شاه عباسي لچك و ترنج:

اين طرح از ديرباز براي تزيين جلدهاي چرمي و كتابهاي قديمي به كار مي‌رفته و از اصالت ويژه‌اي برخوردار است.

فرشهايي كه با اين طرح بافته مي‌شوند داراي ترنجي مياني به شكل دايره يا لوزي هستند كه دو «سرترنج» در بالا و پايين و گاه طرفين نيز آنرا احاطه مي‌كند. چهار گوشه زمينه مياني و متن فرش را نيز چهار نقش يكسان به نام «لچك» كه معمولاً يك چهارم ترنج مياني است، تزيين مي‌كند.

پاره‌اي از طرحهاي شاه‌عباسي لچكهاي 4 گوشه را ندارند كه به آنها «شاه‌ عباسي ترنج دار» گفته مي‌شود.

شاه عباسي افشان:

طرح شاه‌عباسي افشان، ترنج‌ مياني و لچكهاي 4 گوشه را ندارد و سراسر متن فرش را برگها و گل‌هاي اسليمي و ختايي به همراه خطوط مدور و كماني پر مي‌كند.



شاه عباسي طره‌دار:

اين طرح داراي ترنجي ظريف در وسط است و ويژگي اين نقش، طره‌اي است كه به صورت سلسله اي گرداگرد متن آمده است.

به بياني ديگر در اين گونه طرحها، لچك برخلاف معمول از يك چهارم ترنج تشكيل نشده بلكه به صورت طره سراسر متن را دور زده است.
شاه عباسي تصرفي:

اين طرح با دخل و تصرف‌هايي در ساختار كلي طرح شاه عباسي به وجود مي‌آيد. براي نمونه حذف لچكها و استفاده از نيم ترنجهايي در اضلاع متن فرش و برخورداري از قابها و كتيبه‌هاي تزييني به طور قرينه در اضلاع جانبي و تغييراتي از اين دست، از جمله ابداعاتي است كه در طرح به وجود آمده و آنرا به نام تصرفي موسوم مي‌سازد.
     """},

    {'slug':'eslimi',
     'title':'اسلیمی',
     'author':'جمع آورنده : عسکری',
     'image':'c3.jfif',
     'date':date(2020,6,9),
     'short_description':'در طراحي فرش به مجموعه‌اي از اشكال تزييني ويژه‌ كه شبيه دهان باز مار هستند، «اسليمي» گفته مي‌شود.',
     'content':"""
در طراحي فرش به مجموعه‌اي از اشكال تزييني ويژه‌ كه شبيه دهان باز مار هستند، «اسليمي» گفته مي‌شود.

اسليمي را ريشه‌گرفته از واژه «اسليم» به معني «جوانه» دانسته‌اند كه چندان دور از ذهن نيست و گروهي نيز ريشه اين واژه را از كلمه «اسلام» مي‌دانند هرچند كه طرحهاي اسليمي پيش از ورود اسلام به  ايران نيز به كار مي‌رفته است.

طرحهاي اسليمي كه بيشتر در مناطق مركزي ايران مانند اصفهان استفاده مي‌شود، خود انواع مختلفي دارد كه اسليمي دهان اژدري، اسليمي ماري و اسليمي شكسته از آن دسته‌اند.
     """},

    {'slug':'goldani',
     'title':'گلدانی',
     'author':'جمع آورنده : عسکری',
     'image':'c4.jfif',
     'date':date(2020,6,9),
     'short_description':'در طرح گلدانی، شكل گلداني مزين به شاخه‌هاي گل، عنصر اصلي و غالب را تشكيل مي‌دهد',
     'content':"""
     در اين طرح، شكل گلداني مزين به شاخه‌هاي گل، عنصر اصلي و غالب را تشكيل مي‌دهد كه در اندازه‌هاي مختلف (گاهي بزرگ و به صورت واحد و گاهي كوچك و در رديفهاي موازي) تمامي زمينه‌ فرش را پوشش مي‌دهند.

طرح گلداني از ديرباز در ميان فرشبافان قم، تبريز، كاشان، آباده و كردستان مقبوليت فراواني داشته و خود انواعي دارد كه گلداني محرابي، گلداني ظل السلطان، گلداني حاج خانمي و گلداني تكراري از آن جمله‌اند.



گلداني ظل السلطان:

طرحي است گلداني كه در دو طرف آن به جاي دسته‌گلدان، نقش پرنده كار مي‌شود و از درون گلدان نيز گلهاي فراوان روييده است.



گلداني حاج خانمي:

ـ طرحي گلداني  است كه بيشتر در ميان قشقايي‌ها رايج است و درشيراز به آن «نقش ناظم» مي‌گويند و قاليچه‌هاي داراي اين طرح را «ناظم كشكولي» مي‌خوانند. از ويژگي‌هاي مهم اين طرح رعايت دقيق تناسبها و نيز اندازه و ابعاد نگاره‌هاي مشابه و مكرر در سراسر طرح است.

گويا اصطلاح حاج خانمي از نام «حاج خانم جهان آرا بي بي» گرفته شده است كه تلاشي ارزنده در احياي هنر فرشبافي قشقايي داشته است.
     """},


    {'slug':'bote',
     'title':'بته',
     'author':'جمع آورنده : عسکری',
     'image':'c5.jfif',
     'date':date(2020,6,9),
     'short_description':'شباهت اين نقش با شعله مقدس آتش زرتشتيان، ميوه كاج، قطره‌آب، سرو، شاخه نخل، پرنده مهر و... ديدگاههاي متفاوتي را درباره منشاء بته ايجاد كرده است.',
     'content':"""
     درباره ريشه تقشمايه بته نظرات گوناگوني مطرح شده است. شباهت اين نقش با شعله مقدس آتش زرتشتيان، ميوه كاج، قطره‌آب، سرو، شاخه نخل، پرنده مهر و... ديدگاههاي متفاوتي را درباره منشاء بته ايجاد كرده است.

نقشمايه بته در طرحهاي فرش در اندازه‌ها و شكلهاي گوناگوني به چشم مي‌خورد. گاهي چنان بزرگ است كه چند بته براي پوشش سطح فرش كفايت مي كند اما در بيشتر موارد به اندازه‌هاي كوچك در رديفهاي موازي در متن فرش و يا به دنبال هم در حاشيه آن ديده مي‌شود كه گاهي در سبك شكسته نيز استفاده مي‌شود.

طرح بته معمولاً در فرشهاي كرمان، سسندج، همدان، كاشان، سرابند و قم ديده مي‌شود و معروفترين گونه‌هاي آن عبارتند از: بته‌جقه، بته ترمه، بته مادر و فرزند، بته سرابندي، بته قلمكار اصفهاني، بته كردستاني يا هشت‌پر.
     """},
  {'slug':'harati',
     'title':'هراتی',
     'author':'جمع آورنده : عسکری',
     'image':'c6.jfif',
     'date':date(2020,6,9),
     'short_description':'طرح ماهي درهم از دو نگاره ماهي و يك گل در ميان آنها تشكيل شده است.',
     'content':"""
     از آنجا كه نخستين نمونه‌‌هاي اين طرح در هرات به دست آمده است، به اين طرح «هراتي» نيز مي‌گويند. طرح ماهي درهم از دو نگاره ماهي و يك گل در ميان آنها تشكيل شده است. در برخي مناطق غربي ايران، گل مياني در وسط يك لوزي قرار دارد و چهار ماهي يا چهار برگ خميده همانند خميدگي كمرماهي در كناره بيروني چهار ضلعي لوزي بافته مي‌شود.

استان مركزي، خراسان، همدان، بيجار و سنندج جايگاه اصلي طرح ماهي درهم به شمار مي‌آيند.
     """},
 {'slug':'derakhti',
     'title':'درختی',
     'author':'جمع آورنده : عسکری',
     'image':'c7.jfif',
     'date':date(2020,6,9),
     'short_description':'طرح درختي برپايه عنصرهاي مورد استفاده در آن به نقشهاي گوناگوني تقسيم مي‌شود كه طرح حيوان‌دار (جانوري)، سبزيكار (آب نما)، ترنج‌دار، سروي، سراسري و لچك‌وترنج از آن جمله‌اند.',
     'content':"""
قش گياهان و درختان به دليل مقدس بودن آنها نزد ايرانيان باستان، همواره مورد توجه قاليبافان بوده است و امرزه نيز نقش درختي همچنان در بسياري از نقاط ايران بافته مي‌شود اما كارشناسان ريشه اصلي اين طرح را در راور كرمان مي‌دانند.

طرح درختي برپايه عنصرهاي مورد استفاده در آن به نقشهاي گوناگوني تقسيم مي‌شود كه طرح حيوان‌دار (جانوري)، سبزيكار (آب نما)، ترنج‌دار، سروي، سراسري و لچك‌وترنج از آن جمله‌اند.



درختي حيوان‌دار

در اين طرح در ميان شاخ و برگهاي درختان، پرندگاني به چشم مي‌خورند و در پاي درختان نيز حيواناتي در حال چرا و استراحت ديده مي‌شوند.



درختي شكارگاه

اگر در متن و حاشيه طرح درختي، شكارچياني سوار بر اسب و يا پياده در حال صيد ديده ‌شوند، طرح درختي به شكارگاه موسوم مي‌شود.



درختي سبزيكار

اگر در ميان فرش، بركه آبي كه معمولاً با رنگ فيروزه‌اي مشخص شده‌است ديده شود، طرح فرش را درختي سبزيكار يا آب نما مي‌خوانند. در اين طرح شكل كلي درخت ترسيم نشده و شاخه‌ها و ساقه‌هاي پرگل درختان هستند كه عناصر غالب و اصلي طرح را تشكيل مي‌دهند.

طرح درختي سبزيكار از طرحهاي معروفي است كه حدود 60سال پيش از راور كرمان به مجموعه طرحهاي زيباي فرش ايران راه يافت و امروزه بافندگان كاشان، اصفهان، تبريز، قم و تهران به بافت اين طرح علاقه‌مند هستند.

گفتني است بسياري از اروپاييان نقش درخت در فرش را به فال نيك گرفته و آن را نشانه‌اي از تداوم عمر و خوشبختي و سعادت مي‌دانند.
     """},
]
def get_date(post):
    return post['date']


def index(request):
    post_sorted = sorted(all_posts, key=get_date)
    latests = post_sorted[-2:]
    return render(request, 'blogs/index.html', {'latest_posts': latests})

def posts(request):
    return render(request,'blogs/all_post.html',{'all_post':all_posts})
#
def single_post(request,slug):
    post=next(post for post in all_posts if post['slug']==slug )
    return render(request,'blogs/post_details.html',{'post':post})

def product_list(request):
    all_product=product.objects.all().order_by('-price')
    numbers=all_product.count()
    info=all_product.aggregate(Avg('price'),Max('price'),Min('price'))
    return render(request,'blogs/product_list.html',{'all_product':all_product,'numbers':numbers,'info':info})

def product_detail(request,slug):
    pro=get_object_or_404(product,slug=slug)
    return render (request,'blogs/product_details.html',{'pro':pro})

